In [1]:
import pandas as pd
import numpy as np
data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

##### Write a Pandas program to create a dataframe by given dictionary and index as lables

In [2]:
### code here
data=pd.DataFrame({"name":["Anastasia","Dima","Katherine","James","Emily","Michel","Matthew","Laura","Kevin","Jones"],"score":[12.5,9,16.5,np.nan,9,20,14.5,np.nan,8,19],"attempts":[1,3,2,3,2,3,1,1,2,1],"qualify":["yes","no","yes","no","no","yes","yes","no","no","yes"]},index=["a","b","c","d","e","f","g","h","i","j"])
data.head()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no

##### 1. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order

In [4]:
### code here
data.sort_values("name",inplace=True,ascending=False,ignore_index=True)
data.head()

        name  score  attempts qualify
0     Michel   20.0         3     yes
1    Matthew   14.5         1     yes
2      Laura    NaN         1      no
3      Kevin    8.0         2      no
4  Katherine   16.5         2     yes

In [5]:
data.sort_values("score",inplace=True,ascending=True,ignore_index=True)
data.head()

        name  score  attempts qualify
0      Kevin    8.0         2      no
1      Emily    9.0         2      no
2       Dima    9.0         3      no
3  Anastasia   12.5         1     yes
4    Matthew   14.5         1     yes

###### 2. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False

In [12]:
### code here
data["qualify"]=data["qualify"].map({"yes":True, "no":False})

In [14]:
data.head()

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d      James    NaN    False
e      Emily    9.0    False

#### 3. Write a Pandas program to delete the 'attempts' column from the DataFrame

In [11]:
### code here
data.drop("attempts",axis=1,inplace=True)
data.head()

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no

##### 4. Write a Pandas program to insert a new column in existing DataFrame.

In [15]:
### code here
age = [14,13,14,15,16,14,15,16,14,14]
data['age'] = age

In [17]:
data.head()

        name  score  qualify  age
a  Anastasia   12.5     True   14
b       Dima    9.0    False   13
c  Katherine   16.5     True   14
d      James    NaN    False   15
e      Emily    9.0    False   16

##### 5. Write a Pandas program to change the name 'James' to 'Maxwell' in name column of the DataFrame.

In [19]:
### code here
data["name"]=data["name"].replace("James","Maxwell")
data.head()

        name  score  qualify  age
a  Anastasia   12.5     True   14
b       Dima    9.0    False   13
c  Katherine   16.5     True   14
d    Maxwell    NaN    False   15
e      Emily    9.0    False   16

##### 6. Write a Pandas program to rename columns of a given DataFrame

In [8]:
### code here
data=data.rename(columns={"name": "C1", "score": "C2", "qualify":"C3","age":"C4"})
data

          C1    C2 C3   C3
a  Anastasia  12.5  1  yes
b       Dima   9.0  3   no
c  Katherine  16.5  2  yes
d      James   1.0  3   no
e      Emily   9.0  2   no
f     Michel  20.0  3  yes
g    Matthew  14.5  1  yes
h      Laura   1.0  1   no
i      Kevin   8.0  2   no
j      Jones  19.0  1  yes

##### 7. Write a Pandas program to convert the datatype of a given column (floats to ints).

In [14]:
### code here 
data=data.fillna(1)
data.head()

          C1    C2 C3   C3
a  Anastasia  12.5  1  yes
b       Dima   9.0  3   no
c  Katherine  16.5  2  yes
d      James   1.0  3   no
e      Emily   9.0  2   no

In [16]:
data["C2"]=data["C2"].astype(int)

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   C1      10 non-null     object
 1   C2      10 non-null     int32
 2   C3      10 non-null     int64
 3   C3      10 non-null     object
dtypes: int32(1), int64(1), object(2)
memory usage: 360.0+ bytes

###### 8.  Write a Pandas program to convert index in a column of the given dataframe.

In [14]:
### code here
data1=data

In [16]:
data1.set_index("name",inplace=True)
data1

           score  attempts qualify
name
Anastasia   12.5         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michel      20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jones       19.0         1     yes

##### 9. Write a Pandas program to shuffle a DataFrame rows.

In [ ]:
### code here

##### 10 Write a Pandas program to write a DataFrame to CSV file using tab separator

In [18]:
### code here
data=data.sample(frac=1)
data

           score  attempts qualify
name
Laura        NaN         1      no
James        NaN         3      no
Matthew     14.5         1     yes
Emily        9.0         2      no
Jones       19.0         1     yes
Katherine   16.5         2     yes
Kevin        8.0         2      no
Dima         9.0         3      no
Anastasia   12.5         1     yes
Michel      20.0         3     yes

In [20]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

In [21]:
student_data1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [22]:
student_data2

  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

#####11. Write a Pandas program to join the two given dataframes along rows and assign all data.

In [23]:
### code here
new=pd.concat([student_data1,student_data2],ignore_index=True)
new

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S4  Scarlette Fisher    201
6         S5  Carla Williamson    200
7         S6       Dante Morse    198
8         S7    Kaiser William    219
9         S8   Madeeha Preston    201

##### 12. Write a Pandas program to join the two given dataframes along columns and assign all data.

In [27]:
### code here
pd.concat([student_data1,student_data2],axis =1)

  student_id              name  marks student_id              name  marks
0         S1  Danniella Fenton    200         S4  Scarlette Fisher    201
1         S2      Ryder Storey    210         S5  Carla Williamson    200
2         S3      Bryce Jensen    190         S6       Dante Morse    198
3         S4         Ed Bernal    222         S7    Kaiser William    219
4         S5       Kwame Morin    199         S8   Madeeha Preston    201

##### 13. Write a Pandas program to join the two dataframes using the common column of both dataframes.

In [26]:
### code here
pd.concat([student_data1,student_data2],ignore_index=True)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S4  Scarlette Fisher    201
6         S5  Carla Williamson    200
7         S6       Dante Morse    198
8         S7    Kaiser William    219
9         S8   Madeeha Preston    201

###### 14. Write a Pandas program to join (left join) the two dataframes using keys from left dataframe only.

In [24]:
#### code here
pd.merge(student_data1,student_data2,on='student_id',how='left')

  student_id            name_x  marks_x            name_y  marks_y
0         S1  Danniella Fenton      200               NaN      NaN
1         S2      Ryder Storey      210               NaN      NaN
2         S3      Bryce Jensen      190               NaN      NaN
3         S4         Ed Bernal      222  Scarlette Fisher    201.0
4         S5       Kwame Morin      199  Carla Williamson    200.0

###### 15. Write a Pandas program to join two dataframes using keys from right dataframe only.

In [25]:
pd.merge(student_data1,student_data2,on='student_id',how='right')

  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal    222.0  Scarlette Fisher      201
1         S5  Kwame Morin    199.0  Carla Williamson      200
2         S6          NaN      NaN       Dante Morse      198
3         S7          NaN      NaN    Kaiser William      219
4         S8          NaN      NaN   Madeeha Preston      201

In [28]:
### code here
std=pd.concat([student_data1,student_data2],keys=["student_data1","student_data2"])

In [29]:
std

                student_id              name  marks
student_data1 0         S1  Danniella Fenton    200
              1         S2      Ryder Storey    210
              2         S3      Bryce Jensen    190
              3         S4         Ed Bernal    222
              4         S5       Kwame Morin    199
student_data2 0         S4  Scarlette Fisher    201
              1         S5  Carla Williamson    200
              2         S6       Dante Morse    198
              3         S7    Kaiser William    219
              4         S8   Madeeha Preston    201

###### import UFO dataset

In [18]:
data=pd.read_csv("D:\\Innomatics\\Pandas_assignment\\Pandas_day_3\\ufo_sighting_data.csv")
data.head()

C:\Users\Aashish\AppData\Local\Temp\ipykernel_3472\1466547957.py:1: DtypeWarning: Columns (5,9) have mixed types. Specify dtype option on import or set low_memory=False.
  data=pd.read_csv("D:\\Innomatics\\Pandas_assignment\\Pandas_day_3\\ufo_sighting_data.csv")

,Date_time,city,state/province,country,UFO_shape,length_of_encounter_seconds,described_duration_of_encounter,description,date_documented,latitude,longitude
0,10/10/1949 20:30,san marcos,tx,us,cylinder,2700,45 minutes,This event took place in early fall around 194...,4/27/2004,29.8830556,-97.941111
1,10/10/1949 21:00,lackland afb,tx,NaN,light,7200,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.38421,-98.581082
2,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.2,-2.916667
3,10/10/1956 21:00,edna,tx,us,circle,20,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.9783333,-96.645833
4,10/10/1960 20:00,kaneohe,hi,us,light,900,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.4180556,-157.803611

######16. Write a Pandas program to create the todays date.

In [20]:
### code here
pd.Timestamp.now()

Timestamp('2022-09-11 16:53:53.734193')

In [26]:
print(pd.Timestamp.now().date())

2022-11-27

###### 17. Write a Pandas program to get the current date, oldest date and number of days between Current date and oldest date of Ufo dataset.

In [29]:
#### code here
data2=pd.read_csv(r"D:\innomatics\ufo_sighting_data.csv")
data2['Date'] = data2['Date_time'].apply(lambda x : x.split()[0])
data2['Time'] = data2['Date_time'].apply(lambda x : x.split()[1])
data2['Date'] = pd.to_datetime(data2['Date'])
print(data2['Date'].max())
print(data2['Date'].min())

2014-05-08 00:00:00
1906-11-11 00:00:00

###### 18. Write a Pandas program to get all the info of the dataframe between 1950-10-10 and 1960-10-10.

In [30]:
### code here 
data2['Date']=data2['Date'].astype('datetime64')
data2[(data2['Date']>'1950-10-10') & (data2['Date']<'1960-10-10')]

,Date_time,city,state/province,country,UFO_shape,length_of_encounter_seconds,described_duration_of_encounter,description,date_documented,latitude,longitude,Date,Time
2,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.2,-2.916667,1955-10-10,17:00
3,10/10/1956 21:00,edna,tx,us,circle,20,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.9783333,-96.645833,1956-10-10,21:00
480,10/1/1952 03:30,fukuoka (japan),NaN,NaN,disk,1200,about 20 mins,UFO seen by multiple U. S. military personnel;...,12/7/2006,33.590355,130.401716,1952-10-01,03:30
481,10/1/1952 12:00,kansas city,mo,us,disk,90,90 sec.,1952 daylight sighting of multiple discs in fo...,10/31/2008,39.0997222,-94.578333,1952-10-01,12:00
482,10/1/1954 19:00,flatwoods,wv,us,circle,60,1 minute,I saw the craft go across the horizon. It app...,4/12/2013,38.7230556,-80.650000,1954-10-01,19:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...
79262,9/5/1960 21:00,buffalo,ny,us,oval,180.0,3 minutes,Precise movements of a &quot;craft&quot; appar...,9/15/2005,42.886389,-78.878611,1960-09-05,21:00
79668,9/7/1958 19:00,arthur,nd,us,unknown,900.0,5-15 min.,Two lights of alternating color traveling and ...,10/31/2003,47.104167,-97.217778,1958-09-07,19:00
80101,9/9/1952 20:00,philadelphia,pa,us,circle,180.0,3 minutes,saucers in a line over Phila Pa.,12/12/2009,39.952222,-75.164167,1952-09-09,20:00
80102,9/9/1954 12:30,beaumont,tx,us,disk,300.0,5 minutes,Aprox. 30 Disk shaped UFOs fell out of clouds ...,1/17/2004,30.085833,-94.101667,1954-09-09,12:30
80103,9/9/1956 05:55,norfolk,va,us,cigar,90.0,1.5 minutes,Unidentified Object Hovering over Interstate 2...,2/24/2007,36.846667,-76.285556,1956-09-09,05:55